Revit 2024 API
BuiltInFailures.EditingFailures.OutOfDateElements Property
 Workset is editable, but you must Reload Latest before editing the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OutOfDateElements { get; }
Visual Basic
Public Shared ReadOnly Property OutOfDateElements As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OutOfDateElements {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace